Revit 2017 API
AssetPropertyFloatArray Class
 Represents a property consisting of an array of float values.
Namespace: Autodesk.Revit.Utility
Assembly: RevitAPI (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
Since: 2014
Syntax
C#
public class AssetPropertyFloatArray : AssetProperty
Visual Basic
Public Class AssetPropertyFloatArray _
	Inherits AssetProperty
Visual C++
public ref class AssetPropertyFloatArray : public AssetProperty
Remarks
 In virtually all cases, the array will contain exactly 3 values.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.Utility.AssetProperty
 Autodesk.Revit.Utility.AssetPropertyFloatArray
See Also
AssetPropertyFloatArray Members
Autodesk.Revit.Utility Namespace